app/controllers/posts_controller.rb

  def index
    @new_post = Post.new
    @all_posts = Post.order(created_at: :desc).all
---
SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC

  def create
    @post = Post.new(post_params)
    	if @post.save
---
INSERT INTO "posts" ("comment", "created_at", "updated_at") VALUES (?, ?, ?)  [["comment", "Hello, world!"], ["created_at", "2016-02-17 10:38:38.195286"], ["updated_at", "2016-02-17 10:38:38.195286"]]